{
  "config.projectName": "Tutor Cat",
  "config.time.day": "Day",
  "config.time.days": "Days",
  "config.time.month": "Month",
  "config.time.months": "Months",
  "config.time.year": "Year",
  "config.time.years": "Years",
  "config.time.and": "And",
  "config.time.ago": "ago",
  "config.error.questionNotFound": "Question not found",

  "profile.email": "Email",
  "profile.username": "Username",
  "profile.password": "Password",
  "profile.repassword": "Confirm password",
  "profile.example.username": "meowmeow",
  "profile.name": "Name",

  "noti.password.notMatch": "Password not match!",
  "noti.signup.notMatch": "You must enter all the information",
  "noti.signout.success": "Your account has been signed out",
  "noti.signout.error": "Your account hasn't been signed out. You can clean cookies to sign out",
  "noti.vote.error.upvoted": "Your up-vote has been recorded",
  "noti.vote.error.downvoted": "Your down-vote has been recorded",
  "noti.signin.required": "Please login to use this feature",
  "noti.signin.failed": "Sign in failed! Make sure your account is vaild",
  "noti.signin.success": "Sign in successfully!",
  "noti.signup.success": "Your account has been created. Signing in...",
  "noti.signup.failed": "Sign up failed! Make sure your account is vaild",
  "noti.copied": "Copied to clipboard",
  "noti.edit.nopermission": "No permission!",
  "noti.answer.addSuccess": "Add answer successfully!",

  "signin.rememberMe": "Remember Me",
  "signin.signin": "Sign in",
  "signin.btnSignin": "Sign in",
  "signin.forgetPass": "Forget password",
  "signin.newAccount": "Create new account",

  "signup.signup": "Sign up",
  "signup.btnSignup": "Sign up",

  "sidebar.explorer": "Explorer",
  "sidebar.questions": "Questions",
  "sidebar.tags": "Tags",
  "sidebar.public": "Public",
  "sidebar.back": "< Back",
  "sidebar.hello": "Hello, ",

  "modal.btnClose": "Close",
  "modal.btnSubmit": "Submit",
  "modal.loading": "Loading...",

  "navmenu.liveTutor": "Live Tutor",
  "navmenu.language": "Language",
  "navmenu.language.current": "ENG",
  "navmenu.language.english": "English",
  "navmenu.language.vietnamese": "Tiếng Việt",
  "navmenu.profile": "Profile",
  "navmenu.profile.view": "View profile",
  "navmenu.profile.setting": "Setting",
  "navmenu.profile.signout": "Sign out",

  "explorer.name": "Explorer",

  "questions.new": "New question",
  "questions.describeProblem": "Describe your problem below: ",
  "questions.addTags": "Add tags",
  "questions.btnPost": "Post",
  "questions.dateCreated": "Created ",
  "questions.by": "By",
  "questions.modified": "Modified",
  "questions.viewed": "Viewed",
  "questions.edit": "Edit",
  "questions.share": "Share",
  "questions.answer": "Answer",
  "questions.answers": "Answers",
  "questions.answered": "Answered",
  "questions.add.success": "Add question successfully!",
  "questions.add.failed": "Oppss! Your question has some error. You need to complete the question to continute",
  "questions.btn.goTo": "Go to question",
  "questions.title": "Title",
  "questions.writeAnswer": "Your answer",
  "questions.allQuestion": "All questions",
  "questions.questions": "Questions",
  "questions.question": "Question",
  "questions.vote": "Vote",
  "questions.editQuestion": "Edit question",
  "questions.editAnswer": "Edit answer",
  "questions.tags": "Tags",
  "questions.edit.success": "Edit question successfully!",
  "questions.edit.failed": "Oppss! Your question has some error. You need to complete the question to continute",

  "landingpage.slogan": "The First Q&A Website With Video Chat ",
  "landingpage.btn.liveTutor": "Live Tutor",
  "landingpage.btn.topQuestion": "Top Questions",
  "landingpage.featuredIn": "Featured in",
  "landingpage.realTimeQA": "Real time Q&A",
  "landingpage.callVideo": "Call Video",
  "landingpage.codeChat": "Code Chat",
  "landingpage.traditionalQA": "Traditional Q&A",
  "landingpage.liveTutor": "LiveTutor",
  "landingpage.liveTutor.detail": "Ask your first question without typing it out.",
  "landingpage.btn.start": "Start",

  "answers.editAnswer": "Edit answer",
  "answers.edit.success": "Edit answer successfully!",
  "answers.edit.failed": "Oppss! Your answer has some error. You need to complete the answer to continute",

  "error.100.detail": "Continue",
  "error.101.detail": "Switching protocols",
  "error.102.detail": "Processing",
  "error.103.detail": "Early Hints",
  "error.200.detail": "OK",
  "error.201.detail": "Created",
  "error.202.detail": "Accepted",
  "error.204.detail": "No Content",
  "error.205.detail": "Reset Content",
  "error.206.detail": "Partial Content",
  "error.207.detail": "Multi-Status",
  "error.208.detail": "Already Reported",
  "error.226.detail": "IM Used",
  "error.300.detail": "Multiple Choices",
  "error.301.detail": "Moved Permanently",
  "error.302.detail": "Found (Previously 'Moved Temporarily')",
  "error.303.detail": "See Other",
  "error.304.detail": "Not Modified",
  "error.305.detail": "Use Proxy",
  "error.306.detail": "Switch Proxy",
  "error.307.detail": "Temporary Redirect",
  "error.308.detail": "Permanent Redirect",
  "error.400.detail": "Bad Request",
  "error.401.detail": "Unauthorized",
  "error.402.detail": "Payment Required",
  "error.403.detail": "Forbidden",
  "error.404.detail": "Not Found",
  "error.405.detail": "Method Not Allowed",
  "error.406.detail": "Not Acceptable",
  "error.407.detail": "Proxy Authentication Required",
  "error.408.detail": "Request Timeout",
  "error.409.detail": "Conflict",
  "error.410.detail": "Gone",
  "error.411.detail": "Length Required",
  "error.412.detail": "Precondition Failed",
  "error.413.detail": "Payload Too Large",
  "error.414.detail": "URI Too Long",
  "error.415.detail": "Unsupported Media Type",
  "error.416.detail": "Range Not Satisfiable",
  "error.417.detail": "Expectation Failed",
  "error.418.detail": "I'm a Teapot",
  "error.421.detail": "Misdirected Request",
  "error.422.detail": "Unprocessable Entity",
  "error.423.detail": "Locked",
  "error.424.detail": "Failed Dependency",
  "error.425.detail": "Too Early",
  "error.426.detail": "Upgrade Required",
  "error.428.detail": "Precondition Required",
  "error.429.detail": "Too Many Requests",
  "error.431.detail": "Request Header Fields Too Large",
  "error.451.detail": "Unavailable For Legal Reasons",
  "error.500.detail": "Internal Server Error",
  "error.501.detail": "Not Implemented",
  "error.502.detail": "Bad Gateway",
  "error.503.detail": "Service Unavailable",
  "error.504.detail": "Gateway Timeout",
  "error.505.detail": "HTTP Version Not Supported",
  "error.506.detail": "Variant Also Negotiates",
  "error.507.detail": "Insufficient Storage",
  "error.508.detail": "Loop Detected",
  "error.510.detail": "Not Extended",
  "error.511.detail": "Network Authentication Required",
  "error.600.detail": "You can't edit this content",

  "error.opss": "Opss! ",
  "error.gotoHomePage": "Go home",

  "tags.context.andMore": "And More...",
  "tags.tag": "Tag",  

  "tags.javascript.title": "Javascript",
  "tags.javascript.description": "For questions regarding programming in ECMAScript (JavaScript/JS) and its various dialects/implementations (excluding ActionScript). Note JavaScript is NOT the same as Java! Please include all relevant tags on your question; e.g., [node.js], [jquery], [json], [reactjs], [angular], [ember.js], [vue.js], [typescript], [svelte], etc.",

  "tags.python.title": "Python",
  "tags.python.description": "Python is a multi-paradigm, dynamically typed, multi-purpose programming language. It is designed to be quick to learn, understand, and use, and enforces a clean and uniform syntax. Please note that Python 2 is officially out of support as of 2020-01-01. For version-specific Python questions, add the [python-2.7] or [python-3.x] tag. When using a Python variant (e.g. Jython, PyPy) or library (e.g. Pandas, NumPy), please include it in the tags.",

  "tags.java.title": "Java",
  "tags.java.description": "Java is a high-level object oriented programming language. Use this tag when you're having problems using or understanding the language itself. This tag is frequently used alongside other tags for libraries and/or frameworks used by Java developers.",

  "tags.c#.title": "C#",
  "tags.c#.description": "C# (pronounced 'see sharp') is a high level, statically typed, multi-paradigm programming language developed by Microsoft. C# code usually targets Microsoft's .NET family of tools and run-times, which include .NET, .NET Framework and Xamarin among others. Use this tag for questions about code written in C# or about C#'s formal specification.",

  "tags.php.title": "Php",
  "tags.php.description": "PHP is a widely used, open source, general-purpose, multi-paradigm, dynamically typed and interpreted scripting language originally designed for server-side web development. Use this tag for questions about programming in the PHP language.",

  "tags.android.title": "Android",
  "tags.android.description": "Android is Google's mobile operating system, used for programming or developing digital devices (Smartphones, Tablets, Automobiles, TVs, Wear, Glass, IoT). For topics related to Android, use Android-specific tags such as android-intent, android-activity, android-adapter, etc. For questions other than development or programming, but related to the Android framework, use this link: https://android.stackexchange.com.",

  "tags.html.title": "Html",
  "tags.html.description": "HTML (HyperText Markup Language) is the markup language for creating web pages and other information to be displayed in a web browser. Questions regarding HTML should include a minimal reproducible example and some idea of what you're trying to achieve. This tag is rarely used alone and is often paired with [CSS] and [JavaScript].",

  "tags.jquery.title": "Jquery",
  "tags.jquery.description": "jQuery is a JavaScript library, consider also adding the JavaScript tag. jQuery is a popular cross-browser JavaScript library that facilitates Document Object Model (DOM) traversal, event handling, animations and AJAX interactions by minimizing the discrepancies across browsers. A question tagged jQuery should be related to jQuery, so jQuery should be used by the code in question and at least jQuery usage-related elements need to be in the question.",

  "tags.c++.title": "C++",
  "tags.c++.description": "C++ is a general-purpose programming language. It was originally designed as an extension to C and has a similar syntax, but it is now a completely different language. Use this tag for questions about code (to be) compiled with a C++ compiler. Use a version-specific tag for questions related to a specific standard revision [C++11], [C++14], [C++17], [C++20] or [C++23], etc.",

  "tags.css.title": "Css",
  "tags.css.description": "CSS (Cascading Style Sheets) is a representation style sheet language used for describing the look and formatting of HTML (HyperText Markup Language), XML (Extensible Markup Language) documents and SVG elements including (but not limited to) colors, layout, fonts, and animations. It also describes how elements should be rendered on screen, on paper, in speech, or on other media.",

  "tags.ios.title": "iOS",
  "tags.ios.description": "iOS is the mobile operating system running on the Apple iPhone, iPod touch, and iPad. Use this tag [ios] for questions related to programming on the iOS platform. Use the related tags [objective-c] and [swift] for issues specific to those programming languages.",

  "tags.mysql.title": "MySQL",
  "tags.mysql.description": "MySQL is a free, open source Relational Database Management System (RDBMS) that uses Structured Query Language (SQL). DO NOT USE this tag for other DBs such as SQL Server, SQLite etc. Those are different DBs which all use their own dialects of SQL to manage the data.",

  "tags.sql.title": "SQL",
  "tags.sql.description": "Structured Query Language (SQL) is a language for querying databases. Questions should include code examples, table structure, sample data, and a tag for the DBMS implementation (e.g. MySQL, PostgreSQL, Oracle, MS SQL Server, IBM DB2, etc.) being used. If your question relates solely to a specific DBMS (uses specific extensions/features), use that DBMS's tag instead. Answers to questions tagged with SQL should use ISO/IEC standard SQL.",

  "tags.r.title": "R",
  "tags.r.description": "R is a free, open-source programming language & software environment for statistical computing, bioinformatics, visualization & general computing. Please use minimal reproducible example(s) others can run using copy & paste. Show desired output. Use dput() for data & specify all non-base packages with library(). Don't embed pictures for data or code, use indented code blocks instead. For statistics questions, use https://stats.stackexchange.com.",

  "tags.node.js.title": "Node.js",
  "tags.node.js.description": "Node.js is an event-based, non-blocking, asynchronous I/O runtime that uses Google's V8 JavaScript engine and libuv library. It is used for developing applications that make heavy use of the ability to run JavaScript both on the client, as well as on server side and therefore benefit from the re-usability of code and the lack of context switching.",

  "tags.arrays.title": "Arrays",
  "tags.arrays.description": "An array is an ordered linear data structure consisting of a collection of elements (values, variables, or references), each identified by one or more indexes. When asking about specific variants of arrays, use these related tags instead: [vector], [arraylist], [matrix]. When using this tag, in a question that is specific to a programming language, tag the question with the programming language being used.",

  "tags.reactjs.title": "React",
  "tags.reactjs.description": "React is a JavaScript library for building user interfaces. It uses a declarative, component-based paradigm and aims to be both efficient and flexible.",

  "tags.c.title": "C",
  "tags.c.description": "C is a general-purpose programming language used for system programming (OS and embedded), libraries, games and cross-platform. This tag should be used with general questions concerning the C language, as defined in the ISO 9899 standard (the latest version, 9899:2018, unless otherwise specified — also tag version-specific requests with c89, c99, c11, etc). C is distinct from C++ and it should not be combined with the C++ tag absent a rational reason.",

  "tags.asp.net.title": "ASP.NET",
  "tags.asp.net.description": "ASP.NET is a Microsoft web application development framework that allows programmers to build dynamic web sites, web applications and web services. It is useful to use this tag in conjunction with the project type tag e.g. [asp.net-mvc], [asp.net-webforms], or [asp.net-web-api]. Do NOT use this tag for questions about ASP.NET Core - use [asp.net-core] instead.",

  "tags.json.title": "JSON",
  "tags.json.description": "JSON (JavaScript Object Notation) is a serializable data interchange format intended to be machine and human readable. Do not use this tag for native JavaScript objects or JavaScript object literals. Before you ask a question, validate your JSON using a JSON validator such as JSONLint (https://jsonlint.com).",

  "tags.ruby-on-rails.title": "Ruby on Rails",
  "tags.ruby-on-rails.description": "Ruby on Rails is an open source full-stack web application framework written in Ruby. It follows the popular MVC framework model and is known for its 'convention over configuration' approach to application development.",

  "tags..net.title": ".NET",
  "tags..net.description": "Do NOT use for questions about .NET 5+ or .NET Core - use [.net-core] instead. The .NET framework is a software framework designed mainly for the Microsoft Windows operating system. It includes an implementation of the Base Class Library, Common Language Runtime (commonly referred to as CLR), Common Type System (commonly referred to as CTS) and Dynamic Language Runtime. It supports many programming languages, including C#, VB.NET, F# and C++/CLI.",

  "tags.sql-server.title": "SQL Server",
  "tags.sql-server.description": "Microsoft SQL Server is a relational database management system (RDBMS). Use this tag for all Microsoft SQL Server editions including Compact, Express, Azure, Fast-track, APS (formerly PDW) and Azure SQL DW. Do not use this tag for other types of DBMS (MySQL, PostgreSQL, Oracle, etc.). Do not use this tag for issues on software and mobile development, unless it is directly related to the database.",

  "tags.python-3.x.title": "Python 3.x",
  "tags.python-3.x.description": "USE ONLY IF YOUR QUESTION IS VERSION-SPECIFIC. For questions about Python programming that are specific to version 3+ of the language. Use the more generic [python] tag on all Python questions. Use the [python-2.x] tags for Python 2 questions.",

  "tags.swift.title": "Swift",
  "tags.swift.description": "Swift is a general-purpose programming language developed by Apple Inc first released in 2014 for its platforms and Linux. Swift is open-source. Use the tag only for questions about language features, or requiring code in Swift. Use the tags [ios], [ipados], [macos], [watch-os], [tvos], [swiftui], [cocoa-touch], and [cocoa] for (language-agnostic) questions about the platforms or frameworks.",

  "tags.objective-c.title": "Onjective-C",
  "tags.objective-c.description": "should be used only on questions that are about Objective-C features or depend on code in the language. The tags [cocoa] and [cocoa-touch] should be used to ask about Apple's frameworks or classes. Use the related tags [iOS], [macos], [apple-watch] and [tvos] for issues specific to those platforms.",

  "tags.django.title": "Django",
  "tags.django.description": "Django is an open-source server-side web application framework written in Python. It is designed to reduce the effort required to create complex data-driven websites and web applications, with a special focus on less code, no-redundancy and being more explicit than implicit.",

  "tags.angular.title": "Angular",
  "tags.angular.description": "Questions about Angular (not to be confused with AngularJS), the web framework from Google. Use this tag for Angular questions which are not specific to an individual version. For the older AngularJS (1.x) web framework, use the AngularJS tag.",

  "tags.angularjs.title": "AngularJS",
  "tags.angularjs.description": "Use for questions about AngularJS (1.x), the open-source JavaScript framework. Do NOT use this tag for Angular 2 or later versions; instead, use the [angular] tag.",

  "tags.excel.title": "Excel",
  "tags.excel.description": "Only for questions on programming against Excel objects or files, or complex formula development. You may combine the Excel tag with VBA, VSTO, C#, VB.NET, PowerShell, OLE automation, and other programming related tags and questions if applicable. General help regarding Excel for single worksheet functions is available at Super User (http://superuser.com/).",

  "tags.regex.title": "Regular Expressions",
  "tags.regex.description": "Regular expressions provide a declarative language to match patterns within strings. They are commonly used for string validation, parsing, and transformation. Specify the language (PHP, Python, etc) or tool (grep, VS Code, Google Analytics, etc) that you are using. Do not post questions asking for an explanation of what a symbol means or what a particular regular expression will match.",

  "tags.pandas.title": "Pandas",
  "tags.pandas.description": "Pandas is a Python library for data manipulation and analysis, e.g. dataframes, multidimensional time series and cross-sectional datasets commonly found in statistics, experimental science results, econometrics, or finance. Pandas is one of the main data science libraries in Python.",

  "tags.ruby.title": "Ruby",
  "tags.ruby.description": "Ruby is a multi-platform open-source, dynamic object-oriented interpreted language. The [ruby] tag is for questions related to the Ruby language, including its syntax and its libraries. Ruby on Rails questions should be tagged with [ruby-on-rails].",

  "tags.iphone.title": "IPhone",
  "tags.iphone.description": "unless you are addressing Apple's iPhone and/or iPod touch specifically. For questions not dependent on hardware, use the tag [iOS]. More tags to consider are [xcode] (but only if the question is about the IDE itself), [swift], [objective-c] or [cocoa-touch] (but not [cocoa]). Please refrain from questions regarding the iTunes App Store or about iTunes Connect. If using C#, tag with [mono].",

  "tags.ajax.title": "AJAX",
  "tags.ajax.description": "AJAX (Asynchronous JavaScript and XML) is a technique for creating interactive website user interfaces without the traditional web page refresh or reload. It uses asynchronous data exchange between client and server to update displayed information and respond to user interactions seamlessly. Include additional tags for programming languages, libraries, frameworks, web browser, protocols and other environmental information.",

  "tags.linux.title": "Linux",
  "tags.linux.description": "NOTICE: All Linux questions must be related to programming; those that aren't will be closed. Use this tag only if your question relates to  programming using Linux APIs or Linux-specific behavior, not just because you happen to run your code on Linux. If you need Linux support you can try https://unix.stackexchange.com or the specific Linux distribution's Stack Exchange site like https://askubuntu.com or https://elementaryos.stackexchange.com/"
}
