{
  "config.projectName": "Tutor Cat",
  "config.time.day": "Ngày",
  "config.time.days": "Ngày",
  "config.time.month": "Tháng",
  "config.time.months": "Tháng",
  "config.time.year": "Năm",
  "config.time.years": "Năm",
  "config.time.and": "Và",
  "config.time.ago": "trước",
  "config.error.questionNotFound": "Không tìm thấy câu hỏi",

  "profile.email": "Email",
  "profile.username": "Tài khoản",
  "profile.password": "Mật khẩu",
  "profile.repassword": "Xác nhận mật khẩu",
  "profile.example.username": "meowmeow",
  "profile.name": "Tên hiển thị",

  "noti.password.notMatch": "Mật khẩu không khớp!",
  "noti.signup.notMatch": "Bạn phải nhập tất cả thông tin!",
  "noti.signout.success": "Tài khoản của bạn đã được đăng xuất",
  "noti.signout.error": "Tài khoản của bạn chưa được đăng xuất. Bạn có thể xoá Cookies để đăng xuất",
  "noti.vote.error.upvoted": "Bạn đã bình chọn rồi!",
  "noti.vote.error.downvoted": "Bạn đã bình chọn rồi!",
  "noti.signin.required": "Vui lòng đăng nhập để sử dụng",
  "noti.signin.success": "Đăng nhập thành công",
  "noti.signin.failed": "Đăng nhập không thành công! Đảm bảo rằng thông tin tài khoản hợp lệ",
  "noti.signup.success": "Tài khoản của bạn đã được tạo. Đang đăng nhập...",
  "noti.signup.failed": "Đăng kí không thành công! Đảm bảo rằng thông tin tài khoản hợp lệ",
  "noti.copied": "Đã sao chép vào khay nhớ tạm",
  "noti.edit.nopermission": "Không có quyền!",
  "noti.answer.addSuccess": "Thêm câu trả lời thành công!",
  
  "signin.rememberMe": "Nhớ tài khoản",
  "signin.signin": "Đăng nhập",
  "signin.btnSignin": "Đăng nhập",
  "signin.forgetPass": "Quên mật khẩu?",
  "signin.newAccount": "Tạo tài khoản mới",
  "signup.signup": "Đăng ký",
  "signup.btnSignup": "Đăng ký",
  
  "sidebar.explorer": "Khám phá",
  "sidebar.questions": "Câu hỏi",
  "sidebar.tags": "Chuyên mục",
  "sidebar.public": "Cộng đồng",
  "sidebar.back": "< Quay lại",
  "sidebar.hello": "Xin chào, ",
  
  "modal.btnClose": "Đóng",
  "modal.btnSubmit": "Gửi",
  "modal.loading": "Đang tải...",
  
  "navmenu.liveTutor": "Live Tutor",
  "navmenu.language": "Ngôn ngữ",
  "navmenu.language.current": "VIE",
  "navmenu.language.english": "English",
  "navmenu.language.vietnamese": "Tiếng Việt",
  "navmenu.profile": "Người dùng",
  "navmenu.profile.view": "Xem tiểu sử",
  "navmenu.profile.setting": "Cài đặt",
  "navmenu.profile.signout": "Đăng xuất",
 
  "explorer.name": "Khám phá",
  
  "questions.new": "Câu hỏi mới",
  "questions.describeProblem": "Mô tả vấn đề của bạn ở bên dưới: ",
  "questions.addTags": "Gắn nhãn",
  "questions.btnPost": "Gửi",
  "questions.dateCreated": "Tạo vào",
  "questions.by": "Bởi",
  "questions.modified": "Cập nhật",
  "questions.viewed": "Lượt xem",
  "questions.edit": "Chỉnh sửa",
  "questions.share": "Chia sẻ",
  "questions.answer": "Câu trả lời",
  "questions.answers": "Câu trả lời",
  "questions.answered": "Trả lời",
  "questions.add.success": "Tạo câu hỏi thành công!",
  "questions.add.failed": "Ầuuuuuuuuuu! Hình như chúng tôi gặp lỗi với câu hỏi của bạn. Hãy hoàn thành câu hỏi của bạn để tiếp tục",
  "questions.btn.goTo": "Đi đến câu hỏi",
  "questions.title": "Thêm tiêu đề",
  "questions.writeAnswer": "Trả lời",
  "questions.allQuestion": "Tất cả câu hỏi",
  "questions.questions": "Câu hỏi",
  "questions.question": "Câu hỏi",
  "questions.vote": "Bình chọn",
  "questions.editQuestion": "Sửa câu hỏi",
  "questions.editAnswer": "Sửa câu trả lời",
  "questions.tags": "Chuyên mục",
  "questions.edit.success": "Chỉnh sửa câu hỏi thành công!",
  "questions.edit.failed": "Ầuuuuuuuuuu! Hình như chúng tôi gặp lỗi với câu hỏi của bạn. Hãy hoàn thành câu hỏi của bạn để tiếp tục",

  "landingpage.slogan": "Trang web hỏi đáp đầu tiên có trò chuyện video ",
  "landingpage.btn.liveTutor": "Live Tutor",
  "landingpage.btn.topQuestion": "Các câu hỏi hàng đầu",
  "landingpage.featuredIn": "Nổi bật",
  "landingpage.realTimeQA": "Hỏi đáp thời gian thực",
  "landingpage.callVideo": "Gọi Video",
  "landingpage.codeChat": "Code Chat",
  "landingpage.traditionalQA": "Hỏi đáp truyền thống",
  "landingpage.liveTutor": "LiveTutor",
  "landingpage.liveTutor.detail": "Đặt câu hỏi đầu tiên của bạn mà không cần gõ ra.",
  "landingpage.btn.start": "Bắt đầu",

  "answers.editAnswer": "Chỉnh sửa câu trả lời",
  "answers.edit.success": "Chỉnh sửa câu trả lời thành công!",
  "answers.edit.failed": "Ầuuuuuuuuuu! Hình như chúng tôi gặp lỗi với câu trả lời của bạn. Hãy hoàn thành câu trả lời của bạn để tiếp tục",

  "error.100.detail": "Còn nữa",
  "error.101.detail": "Chuyển đổi giao thức",
  "error.102.detail": "Xử lý",
  "error.103.detail": "Gợi ý ban đầu",
  "error.200.detail": "ĐƯỢC RỒI",
  "error.201.detail": "Tạo",
  "error.202.detail": "Đã được chấp nhận",
  "error.204.detail": "Không có nội dung",
  "error.205.detail": "Đặt lại nội dung",
  "error.206.detail": "Nội dung một phần",
  "error.207.detail": "Đa trạng thái",
  "error.208.detail": "Đã được báo cáo",
  "error.226.detail": "IM được sử dụng",
  "error.300.detail": "Nhiều lựa chọn",
  "error.301.detail": "Đã di chuyển vĩnh viễn",
  "error.302.detail": "Đã tìm thấy (Trước đây là 'Đã chuyển tạm thời')",
  "error.303.detail": "Xem Khác",
  "error.304.detail": "Không sửa đổi",
  "error.305.detail": "Sử dụng Proxy",
  "error.306.detail": "Chuyển đổi proxy",
  "error.307.detail": "Chuyển hướng tạm thời",
  "error.308.detail": "Chuyển hướng vĩnh viễn",
  "error.400.detail": "Yêu cầu không hợp lệ",
  "error.401.detail": "Không được phép",
  "error.402.detail": "yêu cầu thanh toán",
  "error.403.detail": "Cấm",
  "error.404.detail": "Không tìm thấy",
  "error.405.detail": "Phương pháp không được phép",
  "error.406.detail": "Không chấp nhận truy cập",
  "error.407.detail": "Yêu cầu xác thực proxy",
  "error.408.detail": "Hết thời gian yêu cầu",
  "error.409.detail": "Cuộc xung đột",
  "error.410.detail": "Không còn",
  "error.411.detail": "Chiều dài yêu cầu",
  "error.412.detail": "Điều kiện tiên quyết không thành công",
  "error.413.detail": "Tải trọng quá lớn",
  "error.414.detail": "URI quá dài",
  "error.415.detail": "Loại phương tiện không được hỗ trợ",
  "error.416.detail": "Phạm vi không đạt yêu cầu",
  "error.417.detail": "Kỳ vọng không thành công",
  "error.418.detail": "Tôi là một ấm trà",
  "error.421.detail": "Yêu cầu sai hướng",
  "error.422.detail": "Thực thể không thể xử lý",
  "error.423.detail": "Đã khóa",
  "error.424.detail": "Không phụ thuộc",
  "error.425.detail": "Quá sớm",
  "error.426.detail": "Yêu cầu nâng cấp",
  "error.428.detail": "Yêu cầu điều kiện tiên quyết",
  "error.429.detail": "Quá nhiều yêu cầu",
  "error.431.detail": "Yêu cầu trường tiêu đề quá lớn",
  "error.451.detail": "Không có sẵn vì lý do pháp lý",
  "error.500.detail": "Lỗi máy chủ nội bộ",
  "error.501.detail": "Không được thực hiện",
  "error.502.detail": "Cổng xấu",
  "error.503.detail": "dịch vụ Không sẵn có",
  "error.504.detail": "Cổng Time-out",
  "error.505.detail": "Phiên bản HTTP không được hỗ trợ",
  "error.506.detail": "Biến thể cũng thương lượng",
  "error.507.detail": "Không đủ bộ nhớ",
  "error.508.detail": "Đã phát hiện vòng lặp",
  "error.510.detail": "Không mở rộng",
  "error.511.detail": "Yêu cầu xác thực mạng",
  "error.600.detail": "Bạn không có quyền để chỉnh sửa mục này",
  "error.opss": "Aisssss chếch tiệc! ",
  "error.gotoHomePage": "Trang chủ",

  "tags.context.andMore": "Còn nữa...",
  "tags.tag": "Chuyên mục",

  "tags.javascript.title": "Javascript",
  "tags.javascript.description": "Đối với các câu hỏi liên quan đến lập trình trong ECMAScript (JavaScript / JS) và các phương ngữ / triển khai khác nhau của nó (ngoại trừ ActionScript). Hãy nhớ rằng JavaScript KHÔNG giống với Java! Vui lòng bao gồm tất cả các nhãn có liên quan trên câu hỏi của bạn; ví dụ: [node.js], [jquery], [json], [reactjs], [angle], [ember.js], [vue.js], [stylescript], [svelte], v.v.",
  "tags.python.title": "Python",
  "tags.python.description": "Python là một ngôn ngữ lập trình có tính đa hình, cho phép thay đổi kiểu biến tùy tùy biến, đa mục đích. Nó được thiết kế để học nhanh, hiểu, sử dụng và thực thi một cú pháp rõ ràng và thống nhất. Xin lưu ý rằng Python 2 chính thức không được hỗ trợ kể từ 2020-01-01. Đối với các câu hỏi Python dành riêng cho phiên bản, hãy thêm nhãn [python-2.7] hoặc [python-3.x]. Khi sử dụng biến thể Python (ví dụ: Jython, PyPy) hoặc thư viện (ví dụ: Pandas, NumPy), vui lòng đưa nó vào các nhãn.",
  "tags.java.title": "Java",
  "tags.java.description": "Java là một ngôn ngữ lập trình hướng đối tượng cấp cao. Sử dụng nhãn này khi bạn gặp sự cố khi sử dụng hoặc hiểu chính ngôn ngữ đó. nhãn này thường được sử dụng cùng với các nhãn khác cho các thư viện và / hoặc khuôn khổ được các nhà phát triển Java sử dụng.",
  "tags.c#.title": "C#",
  "tags.c#.description": "C # (phát âm là 'see sharp') là một ngôn ngữ lập trình đa mô hình, gõ tĩnh, cấp cao được phát triển bởi Microsoft. Code C # thường nhắm mục tiêu đến dòng công cụ và thời gian chạy .NET của Microsoft, bao gồm .NET, .NET Framework và Xamarin trong số những công cụ khác. Sử dụng nhãn này cho các câu hỏi về code được viết bằng C # hoặc về đặc điểm kỹ thuật chính thức của C #.",
  "tags.php.title": "Php",
  "tags.php.description": "PHP là một ngôn ngữ scripting được sử dụng rộng rãi, mã nguồn mở, đa năng, đa mô hình, gõ và thông dịch động, được thiết kế ban đầu để phát triển web phía máy chủ. Sử dụng nhãn này cho các câu hỏi về lập trình bằng ngôn ngữ PHP.",
  "tags.android.title": "Android",
  "tags.android.description": "Android là hệ điều hành di động của Google, được sử dụng để lập trình hoặc phát triển các thiết bị kỹ thuật số (Điện thoại thông minh, Máy tính bảng, Ô tô, TV, Wear, Glass, IoT). Đối với các chủ đề liên quan đến Android, hãy sử dụng các nhãn dành riêng cho Android như android-intent, android-activity, android-adapter, v.v. android.stackexchange.com.",
  "tags.html.title": "Html",
  "tags.html.description": "HTML (HyperText Markup Language) là ngôn ngữ đánh dấu để tạo các trang web và thông tin khác được hiển thị trong trình duyệt web. Các câu hỏi liên quan đến HTML nên bao gồm một ví dụ có thể tái tạo tối thiểu và một số ý tưởng về những gì bạn đang cố gắng đạt được. nhãn này hiếm khi được sử dụng một mình và thường được ghép nối với [CSS] và [JavaScript].",
  "tags.jquery.title": "Jquery",
  "tags.jquery.description": "jQuery là một thư viện JavaScript, hãy xem xét thêm nhãn JavaScript. jQuery là một thư viện JavaScript trên nhiều trình duyệt phổ biến tạo điều kiện thuận lợi cho việc truyền tải Mô hình đối tượng tài liệu (DOM), xử lý sự kiện, hoạt ảnh và tương tác AJAX bằng cách giảm thiểu sự khác biệt giữa các trình duyệt. Một câu hỏi được gắn nhãn jQuery phải liên quan đến jQuery, do đó, jQuery nên được sử dụng bởi code được đề cập và ít nhất các phần tử liên quan đến việc sử dụng jQuery cần phải có trong câu hỏi.",
  "tags.c++.title": "C++",
  "tags.c++.description": "C ++ là một ngôn ngữ lập trình có tính đa dạng. Ban đầu nó được thiết kế như một phần mở rộng của C và có cú pháp tương tự, nhưng nó bây giờ là một ngôn ngữ hoàn toàn khác. Sử dụng nhãn này cho các câu hỏi về code (sẽ được biên dịch bằng trình biên dịch C ++. Sử dụng nhãn dành riêng cho phiên bản cho các câu hỏi liên quan đến bản sửa đổi tiêu chuẩn cụ thể [C ++ 11], [C ++ 14], [C ++ 17], [C ++ 20] hoặc [C ++ 23], v.v. .",
  "tags.css.title": "Css",
  "tags.css.description": "CSS (Cascading Style Sheets) là một ngôn ngữ biểu định kiểu biểu diễn được sử dụng để mô tả giao diện và định dạng của HTML (HyperText Markup Language), tài liệu XML(Extensible Markup Language) và các phần tử SVG bao gồm (nhưng không giới hạn ở) màu sắc, bố cục, phông chữ và hoạt ảnh. Nó cũng mô tả cách các phần tử nên được hiển thị trên màn hình, trên giấy, trong bài phát biểu hoặc trên các phương tiện khác.",
  "tags.ios.title": "iOS",
  "tags.ios.description": "iOS là hệ điều hành di động chạy trên Apple iPhone, iPod touch và iPad. Sử dụng nhãn này [iOS] cho các câu hỏi liên quan đến lập trình trên nền tảng iOS. Sử dụng các nhãn liên quan [target-c] và [swift] cho các vấn đề cụ thể đối với các ngôn ngữ lập trình đó.",
  "tags.mysql.title": "MySQL",
  "tags.mysql.description": "MySQL là Hệ thống quản lý cơ sở dữ liệu quan hệ (RDBMS) mã nguồn mở miễn phí sử dụng Ngôn ngữ truy vấn có cấu trúc (SQL). KHÔNG SỬ DỤNG nhãn này cho các DB khác như SQL Server, SQLite, v.v. Đó là các DB khác nhau, tất cả đều sử dụng phương ngữ SQL của riêng chúng để quản lý dữ liệu.",
  "tags.sql.title": "SQL",
  "tags.sql.description": "Ngôn ngữ truy vấn có cấu trúc (SQL) là một ngôn ngữ để truy vấn cơ sở dữ liệu. Các câu hỏi phải bao gồm các ví dụ về code, cấu trúc bảng, dữ liệu mẫu và nhãn để triển khai DBMS (ví dụ: MySQL, PostgreSQL, Oracle, MS SQL Server, IBM DB2, v.v.) đang được sử dụng. Nếu câu hỏi của bạn chỉ liên quan đến một DBMS cụ thể (sử dụng các phần mở rộng / tính năng cụ thể), hãy sử dụng nhãn của DBMS đó để thay thế. Câu trả lời cho các câu hỏi được gắn nhãn SQL nên sử dụng SQL tiêu chuẩn ISO / IEC.",
  "tags.r.title": "R",
  "tags.r.description": "R là một môi trường phần mềm & ngôn ngữ lập trình mã nguồn mở miễn phí dành cho tính toán thống kê, tin sinh học, hình dung & máy tính tổng hợp. Vui lòng sử dụng (các) ví dụ có thể tái tạo tối thiểu mà những người khác có thể chạy bằng cách sử dụng sao chép và dán. Hiển thị đầu ra mong muốn. Sử dụng dput () cho dữ liệu và chỉ định tất cả các gói không phải cơ sở với thư viện (). Không nhúng ảnh cho dữ liệu hoặc code, thay vào đó hãy sử dụng các khối code thụt lề. Đối với các câu hỏi về thống kê, hãy sử dụng https://stats.stackexchange.com.",
  "tags.node.js.title": "Node.js",
  "tags.node.js.description": "NodeJS là một nền tảng được xây dựng trên V8 JavaScript Engine – trình thông dịch thực thi code JavaScript, giúp xây dựng các ứng dụng web một cách đơn giản và dễ dàng mở rộng.",
  "tags.arrays.title": "Arrays",
  "tags.arrays.description": "Mảng là một cấu trúc dữ liệu tuyến tính có thứ tự bao gồm một tập hợp các phần tử (giá trị, biến hoặc tham chiếu), mỗi phần tử được xác định bởi một hoặc nhiều chỉ mục. Khi hỏi về các biến thể cụ thể của mảng, hãy sử dụng các nhãn liên quan sau: [vector], [arraylist], [matrix]. Khi sử dụng nhãn này, trong một câu hỏi dành riêng cho một ngôn ngữ lập trình, hãy gắn nhãn cho câu hỏi với ngôn ngữ lập trình đang được sử dụng.",
  "tags.reactjs.title": "React",
  "tags.reactjs.description": "React là một thư viện JavaScript để xây dựng giao diện người dùng. Nó sử dụng mô hình khai báo, dựa trên thành phần và nhằm mục đích trở thành cả hai trở nên hiệu quả và linh hoạt",
  "tags.c.title": "C",
  "tags.c.description": "C là một ngôn ngữ lập trình đa năng được sử dụng để lập trình hệ thống (hệ điều hành và nhúng), thư viện, trò chơi và đa nền tảng. nhãn này nên được sử dụng với các câu hỏi chung liên quan đến ngôn ngữ C, như được định nghĩa trong tiêu chuẩn ISO 9899 (phiên bản mới nhất, 9899: 2018, trừ khi được chỉ định khác - cũng gắn nhãn các yêu cầu theo phiên bản cụ thể với c89, c99, c11, v.v.). C khác biệt với C ++ và nó không nên được kết hợp với nhãn C ++ nếu không có lý do hợp lý.",
  "tags.asp.net.title": "ASP.NET",
  "tags.asp.net.description": "ASP.NET là một khung phát triển ứng dụng web của Microsoft cho phép các lập trình viên xây dựng các trang web động, ứng dụng web và dịch vụ web. Sẽ rất hữu ích khi sử dụng nhãn này cùng với nhãn loại dự án, ví dụ: [asp.net-mvc], [asp.net-webforms] hoặc [asp.net-web-api]. KHÔNG sử dụng nhãn này cho các câu hỏi về ASP.NET Core - thay vào đó hãy sử dụng [asp.net-core].",
  "tags.json.title": "JSON",
  "tags.json.description": "JSON (JavaScript Object Notation) là một định dạng trao đổi dữ liệu có thể tuần tự hóa nhằm mục đích là máy móc và con người có thể đọc được. Không sử dụng nhãn này cho các đối tượng JavaScript gốc hoặc các ký tự đối tượng JavaScript. Trước khi bạn đặt câu hỏi, hãy xác thực JSON của bạn bằng trình xác thực JSON chẳng hạn như JSONLint (https://jsonlint.com).",
  "tags.ruby-on-rails.title": "Ruby on Rails",
  "tags.ruby-on-rails.description": "Ruby on Rails à một khung ứng dụng web full-stack mã nguồn mở được viết bằng Ruby. Nó tuân theo MVC phổ biến mô hình khung và được biết đến với cách tiếp cận 'quy ước trên cấu hình' để phát triển ứng dụng.",
  "tags..net.title": ".NET",
  "tags..net.description": "KHÔNG sử dụng cho các câu hỏi về .NET 5+ hoặc .NET Core - thay vào đó hãy sử dụng [.net-core]. .NET framework là một khung phần mềm được thiết kế chủ yếu dành cho hệ điều hành Microsoft Windows. Nó bao gồm việc triển khai Thư viện lớp cơ sở, Thời gian chạy ngôn ngữ chung (thường được gọi là CLR), Hệ thống kiểu chung (thường được gọi là CTS) và Thời gian chạy ngôn ngữ động. Nó hỗ trợ nhiều ngôn ngữ lập trình, bao gồm C #, VB.NET, F # và C ++ / CLI.",
  "tags.sql-server.title": "SQL Server",
  "tags.sql-server.description": "Microsoft SQL Server là một hệ quản trị cơ sở dữ liệu quan hệ (RDBMS). Sử dụng nhãn này cho tất cả các phiên bản Microsoft SQL Server bao gồm Compact, Express, Azure, Fast-track, APS (trước đây là PDW) và Azure SQL DW. Không sử dụng nhãn này cho các loại DBMS khác (MySQL, PostgreSQL, Oracle, v.v.). Không sử dụng nhãn này cho các vấn đề về phát triển phần mềm và thiết bị di động, trừ khi nó liên quan trực tiếp đến cơ sở dữ liệu.",
  "tags.python-3.x.title": "Python 3.x",
  "tags.python-3.x.description": "CHỈ SỬ DỤNG NẾU CÂU HỎI CỦA BẠN LÀ PHIÊN BẢN-CỤ THỂ. Đối với các câu hỏi về lập trình Python dành riêng cho phiên bản 3+ của nó. Sử dụng nhãn [python] chung chung hơn cho tất cả các câu hỏi Python. Sử dụng các nhãn [python-2.x] cho các câu hỏi Python 2.",
  "tags.swift.title": "Swift",
  "tags.swift.description": "Swift là một ngôn ngữ lập trình đa năng được phát triển bởi Apple Inc, được phát hành lần đầu tiên vào năm 2014 cho các nền tảng của nó và Linux. Swift là mã nguồn mở. Chỉ sử dụng nhãn cho các câu hỏi về tính năng ngôn ngữ hoặc yêu cầu code bằng Swift. Sử dụng các nhãn [ios], [ipados], [macos], [watch-os], [tvos], [swiftui], [ca cao-touch] và [ca cao] cho các câu hỏi (ngôn ngữ bất khả tri) về nền tảng hoặc các khuôn khổ.",
  "tags.objective-c.title": "Onjective-C",
  "tags.objective-c.description": "chỉ nên được sử dụng cho các câu hỏi về các tính năng Objective-C hoặc phụ thuộc vào code trong ngôn ngữ. Các nhãn [cocoa] và [cocoa-touch] nên được sử dụng để hỏi về các khung hoặc lớp của Apple. Sử dụng các nhãn liên quan [iOS], [macos], [apple-watch] và [tvos] cho các vấn đề cụ thể đối với các nền tảng đó.",
  "tags.django.title": "Django",
  "tags.django.description": "Django là một khung ứng dụng web phía máy chủ mã nguồn mở được viết bằng Python. Nó được thiết kế để giảm thiểu nỗ lực cần thiết để tạo các trang web và ứng dụng web theo hướng dữ liệu phức tạp, đặc biệt tập trung vào ít code hơn, không dư thừa và rõ ràng hơn là ẩn.",
  "tags.angular.title": "Angular",
  "tags.angular.description": "Các câu hỏi về Angular (đừng nhầm với AngularJS), sườn web từ Google. Sử dụng nhãn này cho các câu hỏi Angular không dành riêng cho một phiên bản riêng lẻ. Đối với khuôn khổ web AngularJS (1.x) cũ hơn, hãy sử dụng nhãn AngularJS.",
  "tags.angularjs.title": "AngularJS",
  "tags.angularjs.description": "Sử dụng cho các câu hỏi về AngularJS (1.x), sườn JavaScript mã nguồn mở. KHÔNG sử dụng nhãn này cho các phiên bản Angular 2 trở lên; thay vào đó, hãy sử dụng nhãn [angle].",
  "tags.excel.title": "Excel",
  "tags.excel.description": "Chỉ dành cho các câu hỏi về lập trình đối với các đối tượng hoặc tệp Excel, hoặc phát triển công thức phức tạp. Bạn có thể kết hợp nhãn Excel với tự động hóa VBA, VSTO, C #, VB.NET, PowerShell, OLE và các nhãn và câu hỏi liên quan đến lập trình khác nếu có. Trợ giúp chung về Excel cho các hàm trang tính đơn có sẵn tại Super User (http://superuser.com/).",
  "tags.regex.title": "Regex",
  "tags.regex.description": "Regular expressions cung cấp một ngôn ngữ khai báo để khớp các mẫu trong chuỗi. Chúng thường được sử dụng cho chuỗi xác thực, phân tích cú pháp và chuyển đổi. Chỉ định ngôn ngữ (PHP, Python, v.v.) hoặc công cụ (grep, VS Code, Google Analytics, v.v.) mà bạn đang sử dụng. Không đăng câu hỏi yêu cầu giải thích ý nghĩa của biểu tượng hoặc biểu thức chính quy cụ thể sẽ khớp với điều gì.",
  "tags.pandas.title": "Pandas",
  "tags.pandas.description": "Pandas là một thư viện Python để thao tác và phân tích dữ liệu, ví dụ: khung dữ liệu, chuỗi thời gian đa chiều và liên dữ liệu thường thấy trong thống kê, kết quả khoa học thực nghiệm, kinh tế lượng hoặc tài chính. Pandas là một trong những thư viện khoa học dữ liệu chính bằng Python.",
  "tags.ruby.title": "Ruby",
  "tags.ruby.description": "Ruby là một ngôn ngữ thông dịch hướng đối tượng động, mã nguồn mở đa nền tảng. Nhãn [Ruby] dành cho các câu hỏi liên quan đến Ngôn ngữ Ruby, bao gồm cú pháp và các thư viện của nó. Các câu hỏi về Ruby on Rails nên được gắn nhãn [ruby-on-rails].",
  "tags.iphone.title": "IPhone",
  "tags.iphone.description": "trừ khi bạn đang giải quyết cụ thể iPhone và / hoặc iPod touch của Apple. Đối với các câu hỏi không phụ thuộc vào phần cứng, hãy sử dụng nhãn [iOS]. Các nhãn khác cần xem xét là [xcode] (nhưng chỉ khi câu hỏi là về chính IDE), [nhanh chóng], [mục tiêu-c] hoặc [ca cao-touch] (nhưng không phải [ca cao]). Vui lòng tránh các câu hỏi liên quan đến iTunes App Store hoặc về iTunes Connect. Nếu sử dụng C #, hãy gắn nhãn bằng [mono].",
  "tags.ajax.title": "AJAX",
  "tags.ajax.description": "AJAX (Không đồng bộ JavaScript và XML) là một kỹ thuật để tạo giao diện người dùng trang web tương tác mà không cần làm mới hoặc tải lại trang web. Nó sử dụng trao đổi dữ liệu không đồng bộ giữa máy khách và máy chủ để cập nhật thông tin hiển thị và đáp ứng các tương tác của người dùng một cách liền mạch. Bao gồm các nhãn bổ sung cho ngôn ngữ lập trình, thư viện, khuôn khổ, trình duyệt web, giao thức và thông tin môi trường khác.",
  "tags.linux.title": "Linux",
  "tags.linux.description": "LƯU Ý: Tất cả các câu hỏi về Linux phải liên quan đến lập trình; nếu không sẽ bị đóng. Chỉ sử dụng nhãn này nếu câu hỏi của bạn liên quan đến lập trình bằng các API Linux hoặc hành vi dành riêng cho Linux, không chỉ vì bạn tình cờ chạy code của mình trên Linux. Nếu bạn cần hỗ trợ Linux, bạn có thể thử https://unix.stackexchange.com hoặc trang Stack Exchange của bản phân phối Linux cụ thể như https://askubuntu.com hoặc https://elementaryos.stackexchange.com/"
}